#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "russian");
	//int mas[10];
	//mas[0] = 45;
	//cin >> mas[1];
	//for (int i = 0; i < 10; i = i + 1) {
	//	cin >> mas[i];
	//}
	//1
	//int mas[5];
	//for (int i = 0; i < 5; i = i + 1) {
	//	cin >> mas[i];
	//}
	//for (int i = 0; i < 5; i = i + 1) {
	//	cout << mas[i] << " ";
	//}
	//Array1. Дано целое число N (> 0). Сформировать и вывести целочисленный массив размера N, содержащий N первых положительных нечетных чисел : 1, 3, 5, . . . .
	//int i, N;
	//int a[100];
	//cout << "N : ";
	//cin >> N;
	//for (i = 1; i <= N; i = i + 1) {
	//	a[i] = (i - 1) * 2 + 1;
	//	cout << a[i] << " ";
	//}
	//Array2. Дано целое число N (> 0). Сформировать и вывести целочисленный массив размера N, содержащий степени двойки от первой до N - й: 2, 4, 8, 16, . . . .
	//int i, N;
	//cout << "введите степень : ";
	//cin >> N;
	//int a[1000];
	//for (i = 1; i < N; i = i + 1) {
	//	a[0] = 2;
	//	a[i] = a[i - 1] * 2;
	//}
	//	for (int i = 0; i < N; i = i + 1) {
	//		cout << i << " = " << a[i] << endl;
	//}
	//Array3. Дано целое число N (> 1), а также первый член A и разность D арифметической прогрессии. Сформировать и вывести массив размера N, содержащий N первых членов данной прогрессии: A, A + D, A + 2·D, A + 3·D, . . . .
	//int n[100];
	//int a, c, d;
	//cout << "введите продолжительность : ";
	//cin >> c;
	//cout << "введите a = ";
	//cin >> a;
	//cout << "введите d = ";
	//cin >> d;
	//for (int i = 0; i < c; i = i + 1) {
	//	n[i] = a + (i * d);
	//}
	//for (int i = 0; i < c; i = i + 1) {
	//	cout << "a[" << i << "]=" << n[i] << endl;
	//}
	//Array4. Дано целое число N (> 1), а также первый член A и знаменатель D геометрической прогрессии.Сформировать и вывести массив размера N, содержащий N первых членов данной прогрессии : A, A·D, A·D2, A·D3, . . . .
	//int n[100];
	//int a, c, d, j;
	//cout << "введите продолжительность : ";
	//cin >> c;
	//cout << "введите a = ";
	//cin >> a;
	//cout << "введите d = ";
	//cin >> d;
	//for (int i = 0; i < c; i = i + 1) {
	//	j = d * i;
	//	n[i] = a * (d * j);
	//}
	//for (int i = 0; i < c; i = i + 1) {
	//	cout << "a[" << i << "]=" << n[i] << endl;
	//}
	//Array5. Дано целое число N (> 2). Сформировать и вывести целочисленный массив размера N, содержащий N первых элементов последовательности чисел Фибоначчи FK : F1 = 1, F2 = 1, FK = FK−2 + FK−1, K = 3, 4, . . . .
	//int N, a1 = 1, a2 = 1, a;
	//cout << "введите N : ";
	//cin >> N;
	//for (int i = 3; i <= N; i = i + 1) {
	//	a = a1 + a2;
	//	a1 = a2;
	//	cout << a << " ";
	//}
}